<!-- dflook/terraform-github-actions {"workspace":"hushline-dev-dev-data","backend_type":"remote","backend":"0179288775f6df7b3d5b1a5963400b5aa085f7db10f59e519a7cce11e4546e41","plan_job_ref":"Job Deploy/Destroy Branch Dev Environment #301 at https://github.com/scidsg/hushline/actions/runs/11001383288","plan_out_hash":"fa9b825e743e431eb39cbbf3efff4ae42da9e459751cb0716209518fc204c794","plan_hash":"a607652b79e518d4d2d63956c183737a39e81485079cb661ac7eb27f474ad135","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform/dev__ in the __hushline-dev-dev-data__ workspace<details open><summary>With variables</summary>

```hcl
branch = "dev-data"
name   = "dev-dev-data"
```
</details>
<details>
<summary>Plan: 1 to add, 0 to change, 1 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app.digitalocean_app.app must be replaced
-/+ resource "digitalocean_app" "app" {
+       active_deployment_id = (known after apply)
!~      created_at           = "2024-09-24 16:12:37 +0000 UTC" -> (known after apply)
+       default_ingress      = (known after apply)
!~      id                   = "************************************" -> (known after apply)
+       live_url             = (known after apply)
!~      updated_at           = "2024-09-24 16:37:03 +0000 UTC" -> (known after apply)
!~      urn                  = "do:app:addb53f5-59bb-4003-b906-e484d669ecbe" -> (known after apply)
#        (1 unchanged attribute hidden)

!~      dedicated_ips (known after apply)

!~      spec {
!~          domains  = [] -> (known after apply)
            name     = "dev-dev-data"
#            (2 unchanged attributes hidden)

!~          domain (known after apply)

!~          ingress (known after apply)
-           ingress {
-               rule {
-                   component {
-                       name                 = "app" -> null
-                       preserve_path_prefix = false -> null
#                        (1 unchanged attribute hidden)
                    }
-                   match {
-                       path {
-                           prefix = "/" -> null
                        }
                    }
                }
            }

!~          job {
!~              dockerfile_path    = "./Dockerfile.prod" -> "./Dockerfile.dev"
                name               = "dev-data"
#                (7 unchanged attributes hidden)

#                (1 unchanged block hidden)
            }

!~          service {
!~              internal_ports     = [] -> (known after apply)
                name               = "app"
+               run_command        = (known after apply)
#                (7 unchanged attributes hidden)

!~              health_check {
-                   failure_threshold     = 0 -> null
-                   initial_delay_seconds = 0 -> null
-                   period_seconds        = 0 -> null
-                   port                  = 0 -> null
-                   success_threshold     = 0 -> null
-                   timeout_seconds       = 0 -> null
#                    (1 unchanged attribute hidden)
                }

!~              routes (known after apply)

#                (1 unchanged block hidden)
            }
!~          service {
!~              http_port          = 0 -> (known after apply)
                name               = "db"
+               run_command        = (known after apply)
#                (7 unchanged attributes hidden)

!~              image {
-                   registry_credentials = (sensitive value) -> null
#                    (4 unchanged attributes hidden)

!~                  deploy_on_push (known after apply)
                }

!~              routes (known after apply)
            }

#            (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
+   app_live_url = (known after apply)
```
</details>

:memo: Plan generated in [Deploy/Destroy Branch Dev Environment #301](https://github.com/scidsg/hushline/actions/runs/11001383288)